Revit 2024 API
FabricationPart.Reposition Method
 Repositions the fabrication straight part to another end of the run.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017
Syntax
C#
public static void Reposition(
	Document document,
	ElementId partId
)
Visual Basic
Public Shared Sub Reposition ( _
	document As Document, _
	partId As ElementId _
)
Visual C++
public:
static void Reposition(
	Document^ document,
	ElementId^ partId
)
Parameters
document
Type: Autodesk.Revit.DB.Document
 The document.
partId
Type: Autodesk.Revit.DB.ElementId
 Identifier of the fabrication part to reposition.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  It is not a straight segment on the end in the run. -or- There are locked parts in the run.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
Autodesk.Revit.Exceptions.InvalidOperationException |  this operation failed.
See Also
FabricationPart Class
Autodesk.Revit.DB Namespace